//  Write a program containing a function which reverse the array passed to it . 

#include <stdio.h>
int main(){

    int arr[] = {1,2,3,4,5,6,7} ; 
    reverse(arr , 7);
    for(int i=0 ; i<7 ; i++){
        printf("The value of %d element is : %d\n" , i , arr[i]) ; 
    }
    return 0 ; 
}

    void reverse(int *arr , int n){
        int temp ; 
        for(int i=0 ; i<(n/2); i++){
            temp = arr[i] ; 
            arr[i] = arr[n-i-1] ; 
            arr[n-i-1] = temp ; 
        }
}

/*  ऊपर के कोड में हम पॉइंटर (*arr) का उपयोग कर रहे हैं क्योंकि हम इस समय एक इंटीजर एरे को उलटा करना चाहते हैं।

जब हम प्रोग्राम में एक इंटीजर एरे को पास करते हैं, तो प्रोग्राम की याददाश्त में इस एरे की कॉपी बनाई जाती है। इसका मतलब है कि यदि हम किसी एरे के किसी एक एलिमेंट में परिवर्तन करते हैं, तो यह परिवर्तन केवल उस एरे के कॉपी में ही होगा और असल एरे में नहीं।

पॉइंटर का उपयोग करके हम प्रोग्राम में एक पॉइंटर बनाते हैं जो उस इंटीजर एरे के पते पर पहुंचता है जिसे हम उलटा करना चाहते हैं। इस पॉइंटर का उपयोग करके हम सीधे उस इंटीजर के मूल्य में परिवर्तन करते हैं जिसे पॉइंटर द्वारा दर्शाया जाता है। इसलिए, पॉइंटर का उपयोग करने से हमें इंटीजर एरे के प्रत्येक एलिमेंट की एक कॉपी पास करने की ज़रूरत नहीं होती है।

*/

